{
  "users": [
    {
      "id": "3d2dde4b6548275fb066",
      "email": "saadhasan@learnwithsumit.com",
      "firstName": "Zahin",
      "lastName": "Hossain",
      "avatar": "avatar-1708764856675-623317122.jpg",
      "bio": "I am Saad Hasan, self-taught Junior Software Developer from Bangladesh. I have been working as a Professional Frontend Developer for the last 1 year, Though I started my Self-Taught Programming Journey In 2014.",
      "password": "$2b$08$e9uY0ZjxXJ9F4r36Ln4oCu4nLZ92OKaQ466VEVDtxBPCs/JL/ChR.",
      "favourites": []
    },
    {
      "id": "65aff389f1822a5e9f43",
      "email": "salahuddin@learnwithsumit.com",
      "firstName": "Md",
      "lastName": "salahuddin",
      "avatar": "avatar-1708882452726-336021919.jpeg",
      "bio": "Check Edited",
      "password": "$2b$08$At/U5W1/ASt/F3zWCqOZnO75ftNVjwR.RVf0FEhEdQ0nHkll5tJ4m",
      "favourites": []
    },
    {
      "id": "d6f0963cf219430cbebd",
      "email": "agontokammo@gmail.com",
      "firstName": "Agonto",
      "lastName": "Azad",
      "avatar": null,
      "bio": "",
      "password": "$2b$08$lWaxeNB/IGnRQhWF09z8IuKMWGmxdM/5BcSWreHG/WQBZ9zRJZSNW",
      "favourites": []
    },
    {
      "id": "293d0fda87baf663270d",
      "email": "raiansanil@gmail.com",
      "firstName": "Raian",
      "lastName": "Hossain",
      "avatar": null,
      "bio": "Bio",
      "password": "$2b$08$aDUibYLQackJUkd7havBr.l7peig/rrZjGUcXpY6dBShE7lZqPVmC",
      "favourites": [
        {
          "id": "4321b782f360f58c8c85",
          "title": "Scope and Scope Chain in JavaScript",
          "tags": "JavaScript, Async, Scope"
        }
      ]
    }
  ],
  "blogs": [
    {
      "id": "4321b782f360f58c8c85",
      "title": "Scope and Scope Chain in JavaScript",
      "content": "In Simple, we can assume Scope as the area, where our program can access our declared variables. Simple is that. There is no Rocket Science behind this to get confused.\n\nBut there are some types of Scope, and we need to understand the differences and how it works. Cause, In larger projects it will help us to avoid collisions.\n\nSo there are 3 types of Scope in JavaScript:\n\n1. Global Scope\n\n2. Function Scope\n\n3. Block Scope.\n\nGlobal Scope:\n\nGlobal Scope is a global area of our JavaScript Codes. It is a default Scope. Any Variable or function that’s not inside any function or block, is inside the global scope by default. So everything we write in our code is into the Global Scope or Globally accessible.\n\nLet’s See an Example:\n\n\nSo, in the example, we declared the name variable and the showName() function in the Global Scope. We can get the value of the name and invoke showName() function from anywhere. That’s we are able to access the name variable from inside the showName() function.\n\nFunctional Scope:\n\nFunctional scope is also known as Local Scope. In functional Scope, variables are declared into a function which means between the curly brackets. And most importantly those variables are only accessible into the function. We can access those variables outside of the function.\n\nLet’s see an example:\n\n\nSo, We can see that we cannot access the variables which are declared in the functional scope outside of that function. And also we can see that functional scope creates its own environment and it doesn’t modify the global variables (name variable remains ‘Tamim’ )\n\nBlock Scope:\n\nSo, Block Scope is almost similar to Function Scope but just applicable for let and const. The area between if/else, loop or switch case is considered as block scope. The declared let/const variables can only be accessed into the scope. But It differs when it comes to the var. We can access the ‘var’ variables outside of the block scopes.\n\nLet’s see an Example:\n\n\nScope Chaining:\n\nScope Chaining is another important concept in JavaScript. Actually, It’s the behavior of JavaScript, how the program will act, or which variable will javaScript pick at a certain point. As we know till now about the three scopes, When JavaScript runs, the browser scope tries to find a variable value in the current scope. If it could not find the value, It tries to go outside of the current scope to find out the value. And it will continue this process until it finds out the variable value or it reaches the Global Scope. In the end, if It fails to find out the value of the variable it will throw a ‘ReferenceError’ or print undefined. And try to relate it by yourself.",
      "thumbnail": "thumbnail-1708765297564-606798153.png",
      "author": {
        "id": "3d2dde4b6548275fb066",
        "firstName": "Jannat",
        "lastName": "Modina",
        "avatar": "avatar-1708764856675-623317122.jpg"
      },
      "tags": "JavaScript, Async, Scope",
      "likes": [
        {
          "id": "293d0fda87baf663270d"
        }
      ],
      "comments": [],
      "createdAt": "2024-02-24T09:01:37.581Z",
      "isFavourite": false
    },
    {
      "id": "4321b782f360f58c8c86",
      "title": "এন্ড্রয়েড পার্মিশন",
      "content": "এন্ড্রয়েড ইউজারদের ললিপপ খাওয়ানোর পাশাপাশি তাদের নিরপত্তার বিষয়টি নিশ্চিত করতে ললিপপ ভার্সন থেকে রান টাইম পার্মিশন নামক একটি অদ্ভুত বস্তু গুগল তাদের খাতায় যোগ করেছে । যেখানে, কোনো এপ ডেভেলোপার যদি তার এপ ইউজারের Storage, Camera, Contacts, Locationঅথবা Microphone সহ অন্যান্য যেকোনো গুরুত্বপূর্ণ এরিয়াতে হাত দিতে চাইলে অবশ্যই ইউজার কতৃক পারমিশন নিয়ে তারপরেই হাতা হাতি করতে হবে । আমার মনে হয় গুগল বাংলাদেশের কথা ভেবেই এই বস্তুটি তাদের খাতায় যুক্ত করেছেন । কারণ, আমরা (৯০% মানুষ) আল্লাহর ওয়াস্তে আমাদের এপ কি কি পার্মিশন নিচ্ছে অথবা Terms & Condition এ কি লেখা আছে সেট না পড়েই সব কিছু তে Allow করে দেই (আমিও এর ব্যাতিক্রম নই 🤓 )। যেটা অনেকটা ঝুকিপূর্ণ, কারণ আমাদের কিছু ভাই রয়েছে (হ্যাকার) যারা RAT বা ট্রজান হর্স দিয়ে খুব সুন্দর করে ভিকটিমের ডেটা নিজের মনে করে চুরি করে নিতে পারে । তা আমি সে বিষয়ে কিছু না বলে আমরা এখানে দেখবো কিভাবে আমরা রানটাইম ইউজারের কাছে পার্মিশন নিতে পারবো । 😁 \n আগের ভার্সন গুলোর মতই আমাদের আগেই AndroidManifest.xml এ পার্মিশন গুলো উল্লেখ করে নিতে হবে",
      "thumbnail": "thumbnail-1731232174119-641397626.jpg",
      "author": {
        "id": "3d2dde4b6548275fb066",
        "firstName": "Jannat",
        "lastName": "Modina",
        "avatar": "avatar-1708764856675-623317122.jpg"
      },
      "tags": "android, java, kotlin, permission",
      "likes": [],
      "comments": [],
      "createdAt": "2024-02-24T09:01:37.581Z",
      "isFavourite": false
    }
  ]
}